7767517
131 158
Input                    data                     0 1 data -23330=4,3,416,416,3 0=416 1=416 2=3
Convolution              0_20                     1 1 data 0_20_bn_leaky -23330=4,3,416,416,6 0=6 1=3 4=1 5=1 6=162 8=102 9=2 -23310=1,1.000000e-01
Convolution              1_28                     1 1 0_20_bn_leaky 1_28_bn_leaky -23330=4,3,208,208,64 0=64 1=3 3=2 4=1 5=1 6=3456 8=2 9=2 -23310=1,1.000000e-01
Split                    1_28_bn_leaky_split      1 2 1_28_bn_leaky 1_28_bn_leaky_split_0 1_28_bn_leaky_split_1 -23330=8,3,208,208,64,3,208,208,64
Convolution              2_36                     1 1 1_28_bn_leaky_split_0 2_36_bn_leaky -23330=4,3,208,208,14 0=14 1=1 5=1 6=896 8=102 9=2 -23310=1,1.000000e-01
Convolution              3_44                     1 1 2_36_bn_leaky 3_44_bn_leaky -23330=4,3,208,208,64 0=64 1=3 4=1 5=1 6=8064 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  4_52                     2 1 3_44_bn_leaky 1_28_bn_leaky_split_1 4_52 -23330=4,3,208,208,64 0=1
Convolution              5_56                     1 1 4_52 5_56_bn_leaky -23330=4,3,104,104,128 0=128 1=3 3=2 4=1 5=1 6=73728 8=2 9=2 -23310=1,1.000000e-01
Split                    5_56_bn_leaky_split      1 2 5_56_bn_leaky 5_56_bn_leaky_split_0 5_56_bn_leaky_split_1 -23330=8,3,104,104,128,3,104,104,128
Convolution              6_64                     1 1 5_56_bn_leaky_split_0 6_64_bn_leaky -23330=4,3,104,104,15 0=15 1=1 5=1 6=1920 8=102 9=2 -23310=1,1.000000e-01
Convolution              7_72                     1 1 6_64_bn_leaky 7_72_bn_leaky -23330=4,3,104,104,128 0=128 1=3 4=1 5=1 6=17280 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  8_80                     2 1 7_72_bn_leaky 5_56_bn_leaky_split_1 8_80 -23330=4,3,104,104,128 0=1
Split                    8_80_split               1 2 8_80 8_80_split_0 8_80_split_1 -23330=8,3,104,104,128,3,104,104,128
Convolution              9_84                     1 1 8_80_split_0 9_84_bn_leaky -23330=4,3,104,104,26 0=26 1=1 5=1 6=3328 8=102 9=2 -23310=1,1.000000e-01
Convolution              10_92                    1 1 9_84_bn_leaky 10_92_bn_leaky -23330=4,3,104,104,128 0=128 1=3 4=1 5=1 6=29952 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  11_100                   2 1 10_92_bn_leaky 8_80_split_1 11_100 -23330=4,3,104,104,128 0=1
Convolution              12_104                   1 1 11_100 12_104_bn_leaky -23330=4,3,52,52,256 0=256 1=3 3=2 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Split                    12_104_bn_leaky_split    1 2 12_104_bn_leaky 12_104_bn_leaky_split_0 12_104_bn_leaky_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              13_112                   1 1 12_104_bn_leaky_split_0 13_112_bn_leaky -23330=4,3,52,52,4 0=4 1=1 5=1 6=1024 8=102 9=2 -23310=1,1.000000e-01
Convolution              14_120                   1 1 13_112_bn_leaky 14_120_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=9216 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  15_128                   2 1 14_120_bn_leaky 12_104_bn_leaky_split_1 15_128 -23330=4,3,52,52,256 0=1
Split                    15_128_split             1 2 15_128 15_128_split_0 15_128_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              16_132                   1 1 15_128_split_0 16_132_bn_leaky -23330=4,3,52,52,10 0=10 1=1 5=1 6=2560 8=102 9=2 -23310=1,1.000000e-01
Convolution              17_140                   1 1 16_132_bn_leaky 17_140_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=23040 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  18_148                   2 1 17_140_bn_leaky 15_128_split_1 18_148 -23330=4,3,52,52,256 0=1
Split                    18_148_split             1 2 18_148 18_148_split_0 18_148_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              19_152                   1 1 18_148_split_0 19_152_bn_leaky -23330=4,3,52,52,21 0=21 1=1 5=1 6=5376 8=102 9=2 -23310=1,1.000000e-01
Convolution              20_160                   1 1 19_152_bn_leaky 20_160_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=48384 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  21_168                   2 1 20_160_bn_leaky 18_148_split_1 21_168 -23330=4,3,52,52,256 0=1
Split                    21_168_split             1 2 21_168 21_168_split_0 21_168_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              22_172                   1 1 21_168_split_0 22_172_bn_leaky -23330=4,3,52,52,29 0=29 1=1 5=1 6=7424 8=102 9=2 -23310=1,1.000000e-01
Convolution              23_180                   1 1 22_172_bn_leaky 23_180_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=66816 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  24_188                   2 1 23_180_bn_leaky 21_168_split_1 24_188 -23330=4,3,52,52,256 0=1
Split                    24_188_split             1 2 24_188 24_188_split_0 24_188_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              25_192                   1 1 24_188_split_0 25_192_bn_leaky -23330=4,3,52,52,40 0=40 1=1 5=1 6=10240 8=102 9=2 -23310=1,1.000000e-01
Convolution              26_200                   1 1 25_192_bn_leaky 26_200_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=92160 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  27_208                   2 1 26_200_bn_leaky 24_188_split_1 27_208 -23330=4,3,52,52,256 0=1
Split                    27_208_split             1 2 27_208 27_208_split_0 27_208_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              28_212                   1 1 27_208_split_0 28_212_bn_leaky -23330=4,3,52,52,38 0=38 1=1 5=1 6=9728 8=102 9=2 -23310=1,1.000000e-01
Convolution              29_220                   1 1 28_212_bn_leaky 29_220_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=87552 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  30_228                   2 1 29_220_bn_leaky 27_208_split_1 30_228 -23330=4,3,52,52,256 0=1
Split                    30_228_split             1 2 30_228 30_228_split_0 30_228_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              31_232                   1 1 30_228_split_0 31_232_bn_leaky -23330=4,3,52,52,39 0=39 1=1 5=1 6=9984 8=102 9=2 -23310=1,1.000000e-01
Convolution              32_240                   1 1 31_232_bn_leaky 32_240_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=89856 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  33_248                   2 1 32_240_bn_leaky 30_228_split_1 33_248 -23330=4,3,52,52,256 0=1
Split                    33_248_split             1 2 33_248 33_248_split_0 33_248_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              34_252                   1 1 33_248_split_0 34_252_bn_leaky -23330=4,3,52,52,46 0=46 1=1 5=1 6=11776 8=102 9=2 -23310=1,1.000000e-01
Convolution              35_260                   1 1 34_252_bn_leaky 35_260_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=105984 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  36_268                   2 1 35_260_bn_leaky 33_248_split_1 36_268 -23330=4,3,52,52,256 0=1
Split                    36_268_split             1 2 36_268 36_268_split_0 36_268_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              37_272                   1 1 36_268_split_0 37_272_bn_leaky -23330=4,3,26,26,512 0=512 1=3 3=2 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Split                    37_272_bn_leaky_split    1 2 37_272_bn_leaky 37_272_bn_leaky_split_0 37_272_bn_leaky_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              38_280                   1 1 37_272_bn_leaky_split_0 38_280_bn_leaky -23330=4,3,26,26,26 0=26 1=1 5=1 6=13312 8=102 9=2 -23310=1,1.000000e-01
Convolution              39_288                   1 1 38_280_bn_leaky 39_288_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=119808 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  40_296                   2 1 39_288_bn_leaky 37_272_bn_leaky_split_1 40_296 -23330=4,3,26,26,512 0=1
Split                    40_296_split             1 2 40_296 40_296_split_0 40_296_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              41_300                   1 1 40_296_split_0 41_300_bn_leaky -23330=4,3,26,26,46 0=46 1=1 5=1 6=23552 8=102 9=2 -23310=1,1.000000e-01
Convolution              42_308                   1 1 41_300_bn_leaky 42_308_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=211968 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  43_316                   2 1 42_308_bn_leaky 40_296_split_1 43_316 -23330=4,3,26,26,512 0=1
Split                    43_316_split             1 2 43_316 43_316_split_0 43_316_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              44_320                   1 1 43_316_split_0 44_320_bn_leaky -23330=4,3,26,26,48 0=48 1=1 5=1 6=24576 8=102 9=2 -23310=1,1.000000e-01
Convolution              45_328                   1 1 44_320_bn_leaky 45_328_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=221184 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  46_336                   2 1 45_328_bn_leaky 43_316_split_1 46_336 -23330=4,3,26,26,512 0=1
Split                    46_336_split             1 2 46_336 46_336_split_0 46_336_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              47_340                   1 1 46_336_split_0 47_340_bn_leaky -23330=4,3,26,26,63 0=63 1=1 5=1 6=32256 8=102 9=2 -23310=1,1.000000e-01
Convolution              48_348                   1 1 47_340_bn_leaky 48_348_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=290304 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  49_356                   2 1 48_348_bn_leaky 46_336_split_1 49_356 -23330=4,3,26,26,512 0=1
Split                    49_356_split             1 2 49_356 49_356_split_0 49_356_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              50_360                   1 1 49_356_split_0 50_360_bn_leaky -23330=4,3,26,26,68 0=68 1=1 5=1 6=34816 8=102 9=2 -23310=1,1.000000e-01
Convolution              51_368                   1 1 50_360_bn_leaky 51_368_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=313344 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  52_376                   2 1 51_368_bn_leaky 49_356_split_1 52_376 -23330=4,3,26,26,512 0=1
Split                    52_376_split             1 2 52_376 52_376_split_0 52_376_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              53_380                   1 1 52_376_split_0 53_380_bn_leaky -23330=4,3,26,26,63 0=63 1=1 5=1 6=32256 8=102 9=2 -23310=1,1.000000e-01
Convolution              54_388                   1 1 53_380_bn_leaky 54_388_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=290304 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  55_396                   2 1 54_388_bn_leaky 52_376_split_1 55_396 -23330=4,3,26,26,512 0=1
Split                    55_396_split             1 2 55_396 55_396_split_0 55_396_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              56_400                   1 1 55_396_split_0 56_400_bn_leaky -23330=4,3,26,26,60 0=60 1=1 5=1 6=30720 8=102 9=2 -23310=1,1.000000e-01
Convolution              57_408                   1 1 56_400_bn_leaky 57_408_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=276480 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  58_416                   2 1 57_408_bn_leaky 55_396_split_1 58_416 -23330=4,3,26,26,512 0=1
Split                    58_416_split             1 2 58_416 58_416_split_0 58_416_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              59_420                   1 1 58_416_split_0 59_420_bn_leaky -23330=4,3,26,26,66 0=66 1=1 5=1 6=33792 8=102 9=2 -23310=1,1.000000e-01
Convolution              60_428                   1 1 59_420_bn_leaky 60_428_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=304128 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  61_436                   2 1 60_428_bn_leaky 58_416_split_1 61_436 -23330=4,3,26,26,512 0=1
Split                    61_436_split             1 2 61_436 61_436_split_0 61_436_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              62_440                   1 1 61_436_split_0 62_440_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 3=2 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Split                    62_440_bn_leaky_split    1 2 62_440_bn_leaky 62_440_bn_leaky_split_0 62_440_bn_leaky_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              63_448                   1 1 62_440_bn_leaky_split_0 63_448_bn_leaky -23330=4,3,13,13,55 0=55 1=1 5=1 6=56320 8=102 9=2 -23310=1,1.000000e-01
Convolution              64_456                   1 1 63_448_bn_leaky 64_456_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=506880 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  65_464                   2 1 64_456_bn_leaky 62_440_bn_leaky_split_1 65_464 -23330=4,3,13,13,1024 0=1
Split                    65_464_split             1 2 65_464 65_464_split_0 65_464_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              66_468                   1 1 65_464_split_0 66_468_bn_leaky -23330=4,3,13,13,70 0=70 1=1 5=1 6=71680 8=102 9=2 -23310=1,1.000000e-01
Convolution              67_476                   1 1 66_468_bn_leaky 67_476_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=645120 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  68_484                   2 1 67_476_bn_leaky 65_464_split_1 68_484 -23330=4,3,13,13,1024 0=1
Split                    68_484_split             1 2 68_484 68_484_split_0 68_484_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              69_488                   1 1 68_484_split_0 69_488_bn_leaky -23330=4,3,13,13,58 0=58 1=1 5=1 6=59392 8=102 9=2 -23310=1,1.000000e-01
Convolution              70_496                   1 1 69_488_bn_leaky 70_496_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=534528 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  71_504                   2 1 70_496_bn_leaky 68_484_split_1 71_504 -23330=4,3,13,13,1024 0=1
Split                    71_504_split             1 2 71_504 71_504_split_0 71_504_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              72_508                   1 1 71_504_split_0 72_508_bn_leaky -23330=4,3,13,13,47 0=47 1=1 5=1 6=48128 8=102 9=2 -23310=1,1.000000e-01
Convolution              73_516                   1 1 72_508_bn_leaky 73_516_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=433152 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  74_524                   2 1 73_516_bn_leaky 71_504_split_1 74_524 -23330=4,3,13,13,1024 0=1
Convolution              75_528                   1 1 74_524 75_528_bn_leaky -23330=4,3,13,13,149 0=149 1=1 5=1 6=152576 8=102 9=2 -23310=1,1.000000e-01
Convolution              76_536                   1 1 75_528_bn_leaky 76_536_bn_leaky -23330=4,3,13,13,137 0=137 1=3 4=1 5=1 6=183717 8=102 9=2 -23310=1,1.000000e-01
Convolution              77_544                   1 1 76_536_bn_leaky 77_544_bn_leaky -23330=4,3,13,13,133 0=133 1=1 5=1 6=18221 8=102 9=2 -23310=1,1.000000e-01
Convolution              78_552                   1 1 77_544_bn_leaky 78_552_bn_leaky -23330=4,3,13,13,151 0=151 1=3 4=1 5=1 6=180747 8=102 9=2 -23310=1,1.000000e-01
Convolution              79_560                   1 1 78_552_bn_leaky 79_560_bn_leaky -23330=4,3,13,13,173 0=173 1=1 5=1 6=26123 8=102 9=2 -23310=1,1.000000e-01
Split                    79_560_bn_leaky_split    1 2 79_560_bn_leaky 79_560_bn_leaky_split_0 79_560_bn_leaky_split_1 -23330=8,3,13,13,173,3,13,13,173
Convolution              80_568                   1 1 79_560_bn_leaky_split_0 80_568_bn_leaky -23330=4,3,13,13,172 0=172 1=3 4=1 5=1 6=267804 8=102 9=2 -23310=1,1.000000e-01
Convolution              81_576                   1 1 80_568_bn_leaky 81_576 -23330=4,3,13,13,27 0=27 1=1 5=1 6=4644 8=2
Convolution              84_597                   1 1 79_560_bn_leaky_split_1 84_597_bn_leaky -23330=4,3,13,13,256 0=256 1=1 5=1 6=44288 8=2 9=2 -23310=1,1.000000e-01
Interp                   85_605                   1 1 84_597_bn_leaky 85_605 -23330=4,3,26,26,256 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   86_608                   2 1 85_605 61_436_split_1 86_608 -23330=4,3,26,26,768
Convolution              87_611                   1 1 86_608 87_611_bn_leaky -23330=4,3,26,26,75 0=75 1=1 5=1 6=57600 8=102 9=2 -23310=1,1.000000e-01
Convolution              88_619                   1 1 87_611_bn_leaky 88_619_bn_leaky -23330=4,3,26,26,79 0=79 1=3 4=1 5=1 6=53325 8=102 9=2 -23310=1,1.000000e-01
Convolution              89_627                   1 1 88_619_bn_leaky 89_627_bn_leaky -23330=4,3,26,26,77 0=77 1=1 5=1 6=6083 8=102 9=2 -23310=1,1.000000e-01
Convolution              90_635                   1 1 89_627_bn_leaky 90_635_bn_leaky -23330=4,3,26,26,99 0=99 1=3 4=1 5=1 6=68607 8=102 9=2 -23310=1,1.000000e-01
Convolution              91_643                   1 1 90_635_bn_leaky 91_643_bn_leaky -23330=4,3,26,26,97 0=97 1=1 5=1 6=9603 8=102 9=2 -23310=1,1.000000e-01
Split                    91_643_bn_leaky_split    1 2 91_643_bn_leaky 91_643_bn_leaky_split_0 91_643_bn_leaky_split_1 -23330=8,3,26,26,97,3,26,26,97
Convolution              92_651                   1 1 91_643_bn_leaky_split_0 92_651_bn_leaky -23330=4,3,26,26,120 0=120 1=3 4=1 5=1 6=104760 8=102 9=2 -23310=1,1.000000e-01
Convolution              93_659                   1 1 92_651_bn_leaky 93_659 -23330=4,3,26,26,27 0=27 1=1 5=1 6=3240 8=2
Convolution              96_680                   1 1 91_643_bn_leaky_split_1 96_680_bn_leaky -23330=4,3,26,26,128 0=128 1=1 5=1 6=12416 8=2 9=2 -23310=1,1.000000e-01
Interp                   97_688                   1 1 96_680_bn_leaky 97_688 -23330=4,3,52,52,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   98_691                   2 1 97_688 36_268_split_1 98_691 -23330=4,3,52,52,384
Convolution              99_694                   1 1 98_691 99_694_bn_leaky -23330=4,3,52,52,43 0=43 1=1 5=1 6=16512 8=102 9=2 -23310=1,1.000000e-01
Convolution              100_702                  1 1 99_694_bn_leaky 100_702_bn_leaky -23330=4,3,52,52,32 0=32 1=3 4=1 5=1 6=12384 8=102 9=2 -23310=1,1.000000e-01
Convolution              101_710                  1 1 100_702_bn_leaky 101_710_bn_leaky -23330=4,3,52,52,33 0=33 1=1 5=1 6=1056 8=102 9=2 -23310=1,1.000000e-01
Convolution              102_718                  1 1 101_710_bn_leaky 102_718_bn_leaky -23330=4,3,52,52,36 0=36 1=3 4=1 5=1 6=10692 8=102 9=2 -23310=1,1.000000e-01
Convolution              103_726                  1 1 102_718_bn_leaky 103_726_bn_leaky -23330=4,3,52,52,32 0=32 1=1 5=1 6=1152 8=102 9=2 -23310=1,1.000000e-01
Convolution              104_734                  1 1 103_726_bn_leaky 104_734_bn_leaky -23330=4,3,52,52,80 0=80 1=3 4=1 5=1 6=23040 8=102 9=2 -23310=1,1.000000e-01
Convolution              105_742                  1 1 104_734_bn_leaky 105_742 -23330=4,3,52,52,27 0=27 1=1 5=1 6=2160 8=2
Yolov3DetectionOutput    detection_out            3 1 81_576 93_659 105_742 output -23330=4,2,6,4,1 0=4 1=3 2=2.500000e-01 -23304=18,1.000000e+01,1.300000e+01,1.600000e+01,3.000000e+01,3.300000e+01,2.300000e+01,3.000000e+01,6.100000e+01,6.200000e+01,4.500000e+01,5.900000e+01,1.190000e+02,1.160000e+02,9.000000e+01,1.560000e+02,1.980000e+02,3.730000e+02,3.260000e+02 -23305=9,1086324736,1088421888,1090519040,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=3,3.200000e+01,1.600000e+01,8.000000e+00
