7767517
131 158
Input                    data                     0 1 data -23330=4,3,416,416,3 0=416 1=416 2=3
Convolution              0_28                     1 1 data 0_28_bn_leaky -23330=4,3,416,416,32 0=32 1=3 4=1 5=1 6=864 8=102 9=2 -23310=1,1.000000e-01
Convolution              1_38                     1 1 0_28_bn_leaky 1_38_bn_leaky -23330=4,3,208,208,64 0=64 1=3 3=2 4=1 5=1 6=18432 8=2 9=2 -23310=1,1.000000e-01
Split                    1_38_bn_leaky_split      1 2 1_38_bn_leaky 1_38_bn_leaky_split_0 1_38_bn_leaky_split_1 -23330=8,3,208,208,64,3,208,208,64
Convolution              2_46                     1 1 1_38_bn_leaky_split_0 2_46_bn_leaky -23330=4,3,208,208,32 0=32 1=1 5=1 6=2048 8=102 9=2 -23310=1,1.000000e-01
Convolution              3_54                     1 1 2_46_bn_leaky 3_54_bn_leaky -23330=4,3,208,208,64 0=64 1=3 4=1 5=1 6=18432 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  4_62                     2 1 3_54_bn_leaky 1_38_bn_leaky_split_1 4_62 -23330=4,3,208,208,64 0=1
Convolution              5_68                     1 1 4_62 5_68_bn_leaky -23330=4,3,104,104,128 0=128 1=3 3=2 4=1 5=1 6=73728 8=2 9=2 -23310=1,1.000000e-01
Split                    5_68_bn_leaky_split      1 2 5_68_bn_leaky 5_68_bn_leaky_split_0 5_68_bn_leaky_split_1 -23330=8,3,104,104,128,3,104,104,128
Convolution              6_76                     1 1 5_68_bn_leaky_split_0 6_76_bn_leaky -23330=4,3,104,104,64 0=64 1=1 5=1 6=8192 8=102 9=2 -23310=1,1.000000e-01
Convolution              7_84                     1 1 6_76_bn_leaky 7_84_bn_leaky -23330=4,3,104,104,128 0=128 1=3 4=1 5=1 6=73728 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  8_92                     2 1 7_84_bn_leaky 5_68_bn_leaky_split_1 8_92 -23330=4,3,104,104,128 0=1
Split                    8_92_split               1 2 8_92 8_92_split_0 8_92_split_1 -23330=8,3,104,104,128,3,104,104,128
Convolution              9_96                     1 1 8_92_split_0 9_96_bn_leaky -23330=4,3,104,104,64 0=64 1=1 5=1 6=8192 8=102 9=2 -23310=1,1.000000e-01
Convolution              10_104                   1 1 9_96_bn_leaky 10_104_bn_leaky -23330=4,3,104,104,128 0=128 1=3 4=1 5=1 6=73728 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  11_112                   2 1 10_104_bn_leaky 8_92_split_1 11_112 -23330=4,3,104,104,128 0=1
Convolution              12_118                   1 1 11_112 12_118_bn_leaky -23330=4,3,52,52,256 0=256 1=3 3=2 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Split                    12_118_bn_leaky_split    1 2 12_118_bn_leaky 12_118_bn_leaky_split_0 12_118_bn_leaky_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              13_126                   1 1 12_118_bn_leaky_split_0 13_126_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              14_134                   1 1 13_126_bn_leaky 14_134_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  15_142                   2 1 14_134_bn_leaky 12_118_bn_leaky_split_1 15_142 -23330=4,3,52,52,256 0=1
Split                    15_142_split             1 2 15_142 15_142_split_0 15_142_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              16_146                   1 1 15_142_split_0 16_146_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              17_154                   1 1 16_146_bn_leaky 17_154_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  18_162                   2 1 17_154_bn_leaky 15_142_split_1 18_162 -23330=4,3,52,52,256 0=1
Split                    18_162_split             1 2 18_162 18_162_split_0 18_162_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              19_166                   1 1 18_162_split_0 19_166_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              20_174                   1 1 19_166_bn_leaky 20_174_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  21_182                   2 1 20_174_bn_leaky 18_162_split_1 21_182 -23330=4,3,52,52,256 0=1
Split                    21_182_split             1 2 21_182 21_182_split_0 21_182_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              22_186                   1 1 21_182_split_0 22_186_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              23_194                   1 1 22_186_bn_leaky 23_194_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  24_202                   2 1 23_194_bn_leaky 21_182_split_1 24_202 -23330=4,3,52,52,256 0=1
Split                    24_202_split             1 2 24_202 24_202_split_0 24_202_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              25_207                   1 1 24_202_split_0 25_207_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              26_215                   1 1 25_207_bn_leaky 26_215_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  27_223                   2 1 26_215_bn_leaky 24_202_split_1 27_223 -23330=4,3,52,52,256 0=1
Split                    27_223_split             1 2 27_223 27_223_split_0 27_223_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              28_227                   1 1 27_223_split_0 28_227_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              29_235                   1 1 28_227_bn_leaky 29_235_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  30_243                   2 1 29_235_bn_leaky 27_223_split_1 30_243 -23330=4,3,52,52,256 0=1
Split                    30_243_split             1 2 30_243 30_243_split_0 30_243_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              31_247                   1 1 30_243_split_0 31_247_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              32_255                   1 1 31_247_bn_leaky 32_255_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  33_263                   2 1 32_255_bn_leaky 30_243_split_1 33_263 -23330=4,3,52,52,256 0=1
Split                    33_263_split             1 2 33_263 33_263_split_0 33_263_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              34_267                   1 1 33_263_split_0 34_267_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              35_275                   1 1 34_267_bn_leaky 35_275_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  36_283                   2 1 35_275_bn_leaky 33_263_split_1 36_283 -23330=4,3,52,52,256 0=1
Split                    36_283_split             1 2 36_283 36_283_split_0 36_283_split_1 -23330=8,3,52,52,256,3,52,52,256
Convolution              37_289                   1 1 36_283_split_0 37_289_bn_leaky -23330=4,3,26,26,512 0=512 1=3 3=2 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Split                    37_289_bn_leaky_split    1 2 37_289_bn_leaky 37_289_bn_leaky_split_0 37_289_bn_leaky_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              38_297                   1 1 37_289_bn_leaky_split_0 38_297_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              39_305                   1 1 38_297_bn_leaky 39_305_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  40_313                   2 1 39_305_bn_leaky 37_289_bn_leaky_split_1 40_313 -23330=4,3,26,26,512 0=1
Split                    40_313_split             1 2 40_313 40_313_split_0 40_313_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              41_318                   1 1 40_313_split_0 41_318_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              42_326                   1 1 41_318_bn_leaky 42_326_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  43_334                   2 1 42_326_bn_leaky 40_313_split_1 43_334 -23330=4,3,26,26,512 0=1
Split                    43_334_split             1 2 43_334 43_334_split_0 43_334_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              44_339                   1 1 43_334_split_0 44_339_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              45_347                   1 1 44_339_bn_leaky 45_347_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  46_355                   2 1 45_347_bn_leaky 43_334_split_1 46_355 -23330=4,3,26,26,512 0=1
Split                    46_355_split             1 2 46_355 46_355_split_0 46_355_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              47_360                   1 1 46_355_split_0 47_360_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              48_368                   1 1 47_360_bn_leaky 48_368_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  49_376                   2 1 48_368_bn_leaky 46_355_split_1 49_376 -23330=4,3,26,26,512 0=1
Split                    49_376_split             1 2 49_376 49_376_split_0 49_376_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              50_380                   1 1 49_376_split_0 50_380_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              51_388                   1 1 50_380_bn_leaky 51_388_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  52_396                   2 1 51_388_bn_leaky 49_376_split_1 52_396 -23330=4,3,26,26,512 0=1
Split                    52_396_split             1 2 52_396 52_396_split_0 52_396_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              53_401                   1 1 52_396_split_0 53_401_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              54_409                   1 1 53_401_bn_leaky 54_409_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  55_417                   2 1 54_409_bn_leaky 52_396_split_1 55_417 -23330=4,3,26,26,512 0=1
Split                    55_417_split             1 2 55_417 55_417_split_0 55_417_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              56_422                   1 1 55_417_split_0 56_422_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              57_430                   1 1 56_422_bn_leaky 57_430_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  58_438                   2 1 57_430_bn_leaky 55_417_split_1 58_438 -23330=4,3,26,26,512 0=1
Split                    58_438_split             1 2 58_438 58_438_split_0 58_438_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              59_442                   1 1 58_438_split_0 59_442_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              60_450                   1 1 59_442_bn_leaky 60_450_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  61_458                   2 1 60_450_bn_leaky 58_438_split_1 61_458 -23330=4,3,26,26,512 0=1
Split                    61_458_split             1 2 61_458 61_458_split_0 61_458_split_1 -23330=8,3,26,26,512,3,26,26,512
Convolution              62_464                   1 1 61_458_split_0 62_464_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 3=2 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Split                    62_464_bn_leaky_split    1 2 62_464_bn_leaky 62_464_bn_leaky_split_0 62_464_bn_leaky_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              63_472                   1 1 62_464_bn_leaky_split_0 63_472_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              64_480                   1 1 63_472_bn_leaky 64_480_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  65_488                   2 1 64_480_bn_leaky 62_464_bn_leaky_split_1 65_488 -23330=4,3,13,13,1024 0=1
Split                    65_488_split             1 2 65_488 65_488_split_0 65_488_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              66_492                   1 1 65_488_split_0 66_492_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              67_500                   1 1 66_492_bn_leaky 67_500_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  68_508                   2 1 67_500_bn_leaky 65_488_split_1 68_508 -23330=4,3,13,13,1024 0=1
Split                    68_508_split             1 2 68_508 68_508_split_0 68_508_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              69_512                   1 1 68_508_split_0 69_512_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              70_520                   1 1 69_512_bn_leaky 70_520_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  71_528                   2 1 70_520_bn_leaky 68_508_split_1 71_528 -23330=4,3,13,13,1024 0=1
Split                    71_528_split             1 2 71_528 71_528_split_0 71_528_split_1 -23330=8,3,13,13,1024,3,13,13,1024
Convolution              72_532                   1 1 71_528_split_0 72_532_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              73_540                   1 1 72_532_bn_leaky 73_540_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=2 9=2 -23310=1,1.000000e-01
Eltwise                  74_548                   2 1 73_540_bn_leaky 71_528_split_1 74_548 -23330=4,3,13,13,1024 0=1
Convolution              75_554                   1 1 74_548 75_554_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              76_562                   1 1 75_554_bn_leaky 76_562_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=102 9=2 -23310=1,1.000000e-01
Convolution              77_570                   1 1 76_562_bn_leaky 77_570_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Convolution              78_578                   1 1 77_570_bn_leaky 78_578_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=102 9=2 -23310=1,1.000000e-01
Convolution              79_586                   1 1 78_578_bn_leaky 79_586_bn_leaky -23330=4,3,13,13,512 0=512 1=1 5=1 6=524288 8=102 9=2 -23310=1,1.000000e-01
Split                    79_586_bn_leaky_split    1 2 79_586_bn_leaky 79_586_bn_leaky_split_0 79_586_bn_leaky_split_1 -23330=8,3,13,13,512,3,13,13,512
Convolution              80_594                   1 1 79_586_bn_leaky_split_0 80_594_bn_leaky -23330=4,3,13,13,1024 0=1024 1=3 4=1 5=1 6=4718592 8=102 9=2 -23310=1,1.000000e-01
Convolution              81_602                   1 1 80_594_bn_leaky 81_602 -23330=4,3,13,13,33 0=33 1=1 5=1 6=33792 8=2
Convolution              84_622                   1 1 79_586_bn_leaky_split_1 84_622_bn_leaky -23330=4,3,13,13,256 0=256 1=1 5=1 6=131072 8=2 9=2 -23310=1,1.000000e-01
Interp                   85_630                   1 1 84_622_bn_leaky 85_630 -23330=4,3,26,26,256 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   86_633                   2 1 85_630 61_458_split_1 86_633 -23330=4,3,26,26,768
Convolution              87_638                   1 1 86_633 87_638_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=196608 8=102 9=2 -23310=1,1.000000e-01
Convolution              88_646                   1 1 87_638_bn_leaky 88_646_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=102 9=2 -23310=1,1.000000e-01
Convolution              89_654                   1 1 88_646_bn_leaky 89_654_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Convolution              90_662                   1 1 89_654_bn_leaky 90_662_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=102 9=2 -23310=1,1.000000e-01
Convolution              91_670                   1 1 90_662_bn_leaky 91_670_bn_leaky -23330=4,3,26,26,256 0=256 1=1 5=1 6=131072 8=102 9=2 -23310=1,1.000000e-01
Split                    91_670_bn_leaky_split    1 2 91_670_bn_leaky 91_670_bn_leaky_split_0 91_670_bn_leaky_split_1 -23330=8,3,26,26,256,3,26,26,256
Convolution              92_678                   1 1 91_670_bn_leaky_split_0 92_678_bn_leaky -23330=4,3,26,26,512 0=512 1=3 4=1 5=1 6=1179648 8=102 9=2 -23310=1,1.000000e-01
Convolution              93_686                   1 1 92_678_bn_leaky 93_686 -23330=4,3,26,26,33 0=33 1=1 5=1 6=16896 8=2
Convolution              96_706                   1 1 91_670_bn_leaky_split_1 96_706_bn_leaky -23330=4,3,26,26,128 0=128 1=1 5=1 6=32768 8=2 9=2 -23310=1,1.000000e-01
Interp                   97_714                   1 1 96_706_bn_leaky 97_714 -23330=4,3,52,52,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   98_717                   2 1 97_714 36_283_split_1 98_717 -23330=4,3,52,52,384
Convolution              99_722                   1 1 98_717 99_722_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=49152 8=102 9=2 -23310=1,1.000000e-01
Convolution              100_730                  1 1 99_722_bn_leaky 100_730_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=102 9=2 -23310=1,1.000000e-01
Convolution              101_738                  1 1 100_730_bn_leaky 101_738_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              102_746                  1 1 101_738_bn_leaky 102_746_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=102 9=2 -23310=1,1.000000e-01
Convolution              103_754                  1 1 102_746_bn_leaky 103_754_bn_leaky -23330=4,3,52,52,128 0=128 1=1 5=1 6=32768 8=102 9=2 -23310=1,1.000000e-01
Convolution              104_762                  1 1 103_754_bn_leaky 104_762_bn_leaky -23330=4,3,52,52,256 0=256 1=3 4=1 5=1 6=294912 8=102 9=2 -23310=1,1.000000e-01
Convolution              105_770                  1 1 104_762_bn_leaky 105_770 -23330=4,3,52,52,33 0=33 1=1 5=1 6=8448 8=2
Yolov3DetectionOutput    detection_out            3 1 81_602 93_686 105_770 output 0=6 1=3 2=5.000000e-02 -23304=18,1.000000e+01,1.300000e+01,1.600000e+01,3.000000e+01,3.300000e+01,2.300000e+01,3.000000e+01,6.100000e+01,6.200000e+01,4.500000e+01,5.900000e+01,1.190000e+02,1.160000e+02,9.000000e+01,1.560000e+02,1.980000e+02,3.730000e+02,3.260000e+02 -23305=9,1086324736,1088421888,1090519040,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=3,3.200000e+01,1.600000e+01,8.000000e+00
